<?php

return [
    /*
    |----------------------------------------------------------------------------
    | API_URL
    |----------------------------------------------------------------------------
    | Известные url:
    | https://api.boxberry.de/json.php - для старых клиентов;
    | https://api.boxberry.ru/json.php - для новых клиентов;
    | https://account.boxberry.ru/json.php - для новых клиентов;
    | https://api.boxberry.org - резервный адрес.
    |----------------------------------------------------------------------------
    | По-умолчанию выбран https://api.boxberry.ru/json.php
    |----------------------------------------------------------------------------
    */
    'api_uri' => env('BOXBERRY_API_URI', 'https://api.boxberry.ru/json.php'),

    /*
    |----------------------------------------------------------------------------
    | Список токенов.
    |----------------------------------------------------------------------------
    | По-умолчанию используется токен main
    |----------------------------------------------------------------------------
    */

    'tokens' => [
        'main' => env('BOXBERRY_TOKEN', ''),
        'another' => env('BOXBERRY_ANOTHER_TOKEN', ''),
        // Другие токены
    ],

    /*
    |----------------------------------------------------------------------------
    | Таймаут ожидания ответа
    |----------------------------------------------------------------------------
    | По умолчанию 30 секунд
    |----------------------------------------------------------------------------
    */
    'timeout' => 30,

];
